Revit 2026 API

# CommandMenuItem Properties

---

The CommandMenuItem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from MenuItem) |

#### Reference

CommandMenuItem Class

Autodesk.Revit.UI Namespace